In [47]:
import pandas as pd
import numpy as np
import importlib   # Import the importlib module
import Create_Zoo
import random
import plotly.express as px
import datetime
import string
from datetime import timedelta

In [131]:
def glimpse(file_name):

    df = pd.read_csv(f'./data/{file_name}')

    print(f"\nFile {file_name}")
    print(f"Rows: {df.shape[0]}, Columns: {df.shape[1]}")

    n = df.shape[0] if df.shape[0] < 5 else 5
    df_random = df.sample(n=n, random_state=42, replace=False)

    for col in df_random.columns:
        print(f"{col:20}: {df_random[col].iloc[:4].tolist()}")

In [135]:
padded_string = 'xxx'.ljust(20)
print(f'>{padded_string}<')

>xxx                 <

In [ ]:
files = ['Zoo-Zones.csv', 'Zoo-Enclosures.csv', 'Zoo-Animals.csv', 'Zoo-Staff.csv', 
         'Zoo-Budgets.csv', 'Zoo-Calendar.csv', 'Zoo-Invoices.csv',
         'Zoo-Visits.csv',]

for file in files:
    glimpse(file)

File Zoo-Zones.csv
Rows: 3, Columns: 2
Zone_ID             : [1, 2, 3]
Zone                : ['Aquatic', 'Big Cats', 'Monkeys']

File Zoo-Enclosures.csv
Rows: 15, Columns: 10
Enclosure_ID        : ['02/0010', '03/0012', '01/0001', '03/0014']
Name                : ['Cougar', 'Goodall', 'Darwin', 'Koehler']
WikiURL             : ['https://en.wikipedia.org/wiki/Cougar', 'https://en.wikipedia.org/wiki/Jane_Goodall', 'https://en.wikipedia.org/wiki/Charles_Darwin', 'https://en.wikipedia.org/wiki/Wolfgang_KÃ¶hler']
Zone                : ['Big Cats', 'Monkeys', 'Aquatic', 'Monkeys']
Animal              : ['Cheetahs', 'Chimpanzees', 'Penguins', 'Orangutans']
Capacity            : [0, 8, 10, 5]
Current_Number      : [0, 7, 10, 5]
Diet                : ['Meat', 'Plants', 'Fish', 'Fruits']
Status              : ['Closed', 'Open', 'Open', 'Open']
Closed_Date         : ['2024-03-26', nan, nan, nan]

File Zoo-Animals.csv
Rows: 79, Columns: 8
Enclosure_ID        : ['01/0004', '01/0001', '01/0003', '01/0004']
Animal_ID           : ['J-7809', 'W-3572', 'A-4674', 'A-6954']
SubSpecies          : ['Flamingos', 'Emperor Penguin', 'Humbolt Penguin', 'Flamingos']
Name                : [nan, nan, nan, nan]
Age                 : [9, 25, 16, 15]
Gender              : ['Female', 'Male', 'Female', 'Female']
Arrival_Date        : ['2016-06-12', '2023-08-22', '2024-07-27', '2020-03-02']
Health_Status       : ['Under Treatment', 'Under Treatment', 'Under Treatment', 'Minor Issues']

File Zoo-Staff.csv
Rows: 96, Columns: 7
Staff_ID            : ['w5gprynf2evxtlbi', 'h13xskhsz9y6q9g5', 'r45u9jmxda558ofe', 'vor3scgg3nfvkbly']
Zone                : ['From Enclosure Id', 'From Enclosure Id', 'From Enclosure Id', 'From Enclosure Id']
Enclosure_ID        : ['03/0013', '03/0012', '03/0012', '03/0015']
Name                : ['Pearl Fletcher', 'Sarah Taylor', 'Alex Smith', 'Pearl Thatcher']
Role                : ['Staff', 'Staff', 'Staff', 'Staff']
FTE                 : [0.6, 1.0, 1.0, 0.5]
Start_time          : ['Morning', 'Morning', 'Afternoon', 'Afternoon']

File Zoo-Budgets.csv
Rows: 180, Columns: 4
Month               : ['2024-02', '2024-03', '2024-11', '2024-06']
Order Type          : ['Fruit', 'Plants', 'Fruit', 'Fruit']
Enclosure           : ['03/0014', '03/0015', '03/0013', '03/0013']
Budget              : [600.0, 60.0, 150.0, 150.0]

File Zoo-Calendar.csv
Rows: 366, Columns: 8
day_of_year         : [194, 34, 16, 311]
date                : ['2024-07-12', '2024-02-03', '2024-01-16', '2024-11-06']
day_of_week         : ['Friday', 'Saturday', 'Tuesday', 'Wednesday']
type                : ['Normal Day', 'Normal Day', 'Normal Day', 'Normal Day']
weekend             : [False, True, False, False]
bank_holiday        : [False, False, False, False]
school_holiday      : [False, False, False, False]
visits              : [941, 736, 623, 645]

File Zoo-Invoices.csv
Rows: 72, Columns: 4
Invoice_ID          : ['Zoo-0006', 'Zoo-0074', 'Zoo-0023', 'Zoo-0002']
Month               : ['2024-01', '2024-11', '2024-04', '2024-01']
Order Type          : ['Coffee', 'Meat', 'Fish', 'Fish']
Cost                : [109.11, 3878.67, 1914.25, 2951.42]

File Zoo-Visits.csv
Rows: 275062, Columns: 3
Date                : ['2024-10-16', '2024-07-29', '2024-03-01', '2024-05-22']
Enclosure_ID        : ['02/0008', '03/0013', '02/0007', '02/0006']
Member_ID           : [nan, nan, nan, nan]

In [ ]:
y = df_Enclosures[['Enclosure_ID','Zone','Name']]
y.columns = ['Enclosure_ID','Zoney','Namey']
df_Staff = pd.merge(df_Staff, y, on='Enclosure_ID', how='outer')

,Staff_ID,Zone,Enclosure_ID,Name,Role,FTE,Start_time,Zoney,Namey
0,cghmyfhw9448sndq,From Enclosure Id,01/0001,Dan Johnson,Staff,0.6,Morning,Aquatic,Darwin
1,m8r6qid3jcrr6qr4,From Enclosure Id,01/0001,Ed Jones,Staff,1.0,Morning,Aquatic,Darwin
2,9ai8q3imldjl9rtm,From Enclosure Id,01/0001,Pearl Brown,Staff,1.0,Afternoon,Aquatic,Darwin
3,vwamk1e931he2zsp,From Enclosure Id,01/0001,Alex White,Staff,0.7,Morning,Aquatic,Darwin
4,k5lu0keepzbfsozh,From Enclosure Id,01/0001,Ed Thatcher,Staff,0.7,Afternoon,Aquatic,Darwin
...,...,...,...,...,...,...,...,...,...
91,n6bsm109fz9pqujk,Aquatic,NaN,Louise Jones,Supervisor,1.0,Morning,NaN,NaN
92,k4numnq6aitp0ssw,Big Cats,NaN,Morgan Martin,Vet,1.0,Morning,NaN,NaN
93,f2wzute5rn7iv7qj,Big Cats,NaN,Dakota Brownlee,Supervisor,1.0,Afternoon,NaN,NaN
94,domkpli1g9jymcdj,Monkeys,NaN,Ellen Fletcher,Vet,1.0,Morning,NaN,NaN
95,2mjwgxhvqpj12dg0,Monkeys,NaN,Chris Smith,Supervisor,1.0,Morning,NaN,NaN

In [55]:
# df_Staff['Where'] = df_Staff.apply(lambda row: row['Zone'] if pd.isna(row['Enclosure_ID']) else row['Zoney'])
#x = np.where(x['Enclosure_ID'].isna(), x['Zone'], x['Zoney'])
#df_Staff['Text'] = df_Staff.apply(lambda row: f"{row['Name']} ({row['Role']}) Working Pattern : FTE = {row['FTE']}, starts {row['Start_time']}", axis=1)

# Compute 'Text' column using lambda and apply
df_Staff['myZone'] = df_Staff.apply(lambda row: row['Zone'] if pd.isna(row['Enclosure_ID']) else row['Zoney'], axis=1)
df_Staff['Text'] = df_Staff.apply(lambda row: f"{row['Name']} ({row['Role']}) in the {row['myZone']} Zone", axis=1)

x = df_Staff[['Staff_ID','FTE','Start_time','Text']]
x

,Staff_ID,FTE,Start_time,Text
0,cghmyfhw9448sndq,0.6,Morning,Dan Johnson (Staff) in the Aquatic Zone
1,m8r6qid3jcrr6qr4,1.0,Morning,Ed Jones (Staff) in the Aquatic Zone
2,9ai8q3imldjl9rtm,1.0,Afternoon,Pearl Brown (Staff) in the Aquatic Zone
3,vwamk1e931he2zsp,0.7,Morning,Alex White (Staff) in the Aquatic Zone
4,k5lu0keepzbfsozh,0.7,Afternoon,Ed Thatcher (Staff) in the Aquatic Zone
...,...,...,...,...
91,n6bsm109fz9pqujk,1.0,Morning,Louise Jones (Supervisor) in the Aquatic Zone
92,k4numnq6aitp0ssw,1.0,Morning,Morgan Martin (Vet) in the Big Cats Zone
93,f2wzute5rn7iv7qj,1.0,Afternoon,Dakota Brownlee (Supervisor) in the Big Cats Zone
94,domkpli1g9jymcdj,1.0,Morning,Ellen Fletcher (Vet) in the Monkeys Zone
95,2mjwgxhvqpj12dg0,1.0,Morning,Chris Smith (Supervisor) in the Monkeys Zone

In [50]:
x

array(['Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic',
       'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic',
       'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic',
       'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic',
       'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic', 'Aquatic',
       'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats',
       'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats',
       'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats',
       'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats',
       'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats',
       'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats', 'Big Cats',
       'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys',
       'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys',
       'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys',
       'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys',
       'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys', 'Monkeys',
       'Aquatic', 'Aquatic', 'Big Cats', 'Big Cats', 'Monkeys', 'Monkeys'],
      dtype=object)

In [35]:
df_Staff['Text']

0     Dan Martin (Vet) Working Pattern : FTE = 1.0, ...
1     Louise Jones (Supervisor) Working Pattern : FT...
2     Morgan Martin (Vet) Working Pattern : FTE = 1....
3     Dakota Brownlee (Supervisor) Working Pattern :...
4     Ellen Fletcher (Vet) Working Pattern : FTE = 1...
                            ...
91    Sarah Martin (Staff) Working Pattern : FTE = 0...
92    Rosa Thomas (Staff) Working Pattern : FTE = 1....
93    Sarah Johnson (Staff) Working Pattern : FTE = ...
94    Pearl Thatcher (Staff) Working Pattern : FTE =...
95    Dan Anderson (Staff) Working Pattern : FTE = 1...
Name: Text, Length: 96, dtype: object

In [33]:
df_Staff

,Staff_ID,Zone,Enclosure_ID,Name,Role,FTE,Start_time
0,cll2gbtxxac3jldy,Aquatic,NaN,Dan Martin,Vet,1.0,Afternoon
1,n6bsm109fz9pqujk,Aquatic,NaN,Louise Jones,Supervisor,1.0,Morning
2,k4numnq6aitp0ssw,Big Cats,NaN,Morgan Martin,Vet,1.0,Morning
3,f2wzute5rn7iv7qj,Big Cats,NaN,Dakota Brownlee,Supervisor,1.0,Afternoon
4,domkpli1g9jymcdj,Monkeys,NaN,Ellen Fletcher,Vet,1.0,Morning
...,...,...,...,...,...,...,...
91,1dzwlh6mwfbsuq8m,From Enclosure Id,03/0015,Sarah Martin,Staff,0.6,Morning
92,hnk36g45w9mc77u5,From Enclosure Id,03/0015,Rosa Thomas,Staff,1.0,Morning
93,g9pw7nmq7hfukuq9,From Enclosure Id,03/0015,Sarah Johnson,Staff,1.0,Afternoon
94,vor3scgg3nfvkbly,From Enclosure Id,03/0015,Pearl Thatcher,Staff,0.5,Afternoon
95,rp7w2r9t4x18ahym,From Enclosure Id,03/0015,Dan Anderson,Staff,1.0,Morning